Revit 2027 API
StructuralElementDefinitionData Constructor
 Creates empty StructuralElementDefinitionData object.
Namespace: Autodesk.Revit.DB.Structure.StructuralSections
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public StructuralElementDefinitionData()
Public Sub New
public:
StructuralElementDefinitionData()
new : unit -> StructuralElementDefinitionData
See Also
Reference
StructuralElementDefinitionData Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace